In [ ]:
#importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#loading the dataset
# The dataset is loaded from the Hugging Face Hub
dataset = load_dataset("lukebarousse/data_jobs")
df = dataset['train'].to_pandas()



#Data cleaning
df['job_posted_date'] = pd.to_datetime(df.job_posted_date)

In [5]:
median_year_salary = df['salary_year_avg'].median()
median_hour_salary = df['salary_hour_avg'].median()

In [12]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_year_salary)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_hour_salary)

In [15]:
df_filled.loc[:10, ['salary_year_avg', 'salary_hour_avg']]

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [ ]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

In [27]:
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

print(f"Number of unique job postings: {len(df_filled)}")
print(f'Number of unique job postings after removing duplicates: {len(df_unique)}')
print(f"Rows Dropped: {len(df_filled) - len(df_unique)}")

Number of unique job postings: 785741
Number of unique job postings after removing duplicates: 508042
Rows Dropped: 277699